app/controllers/rooms_controller.rb

  def index
    @rooms = Room.where(:public => true).order("created_at DESC").limit(25)
---
SELECT `rooms`.* FROM `rooms` WHERE (`rooms`.`public` = 1) ORDER BY created_at DESC LIMIT 25