app/controllers/rooms_controller.rb

  def index
    @rooms = Room.where(:public => 1)
---
SELECT `rooms`.* FROM `rooms` WHERE (`rooms`.`public` = 1) ORDER BY created_at DESC

  def create
    config_opentok
    session = @opentok.create_session request.remote_addr
    params[:room][:sessionId] = session.session_id

    @new_room = Room.new(params[:room])

    respond_to do |format|
      if @new_room.save
---
INSERT INTO `rooms` (`created_at`, `name`, `public`, `sessionId`, `updated_at`) VALUES ('2011-03-19 04:50:00', NULL, NULL, NULL, '2011-03-19 04:50:00')

  def party
    @room = Room.find(params[:id])
---
SELECT `rooms`.* FROM `rooms` WHERE (`rooms`.`id` = 2181505840) LIMIT 1